; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-24-22)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 room24 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 - object)
(:init
(at-robby robot1 room5)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room14)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room1)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room5)
(at ball2 room2)
(at ball3 room9)
(at ball4 room8)
(at ball5 room8)
(at ball6 room5)
(at ball7 room10)
(at ball8 room20)
(at ball9 room15)
(at ball10 room21)
(at ball11 room17)
(at ball12 room16)
(at ball13 room6)
(at ball14 room23)
(at ball15 room4)
(at ball16 room22)
(at ball17 room1)
(at ball18 room17)
(at ball19 room7)
(at ball20 room1)
(at ball21 room9)
(at ball22 room4)
)
(:goal
(and
(at ball1 room18)
(at ball2 room1)
(at ball3 room8)
(at ball4 room6)
(at ball5 room20)
(at ball6 room9)
(at ball7 room11)
(at ball8 room9)
(at ball9 room10)
(at ball10 room15)
(at ball11 room10)
(at ball12 room18)
(at ball13 room22)
(at ball14 room18)
(at ball15 room23)
(at ball16 room8)
(at ball17 room13)
(at ball18 room14)
(at ball19 room4)
(at ball20 room6)
(at ball21 room5)
(at ball22 room10)
)
)
)

; plan
1. (pick robot3 ball20 room1 lgripper3)
   deleted: (at ball20 room1) (free robot3 lgripper3)
   added: (carry robot3 ball20 lgripper3)
   goals met: 0 of 22
2. (pick robot3 ball17 room1 rgripper3)
   deleted: (at ball17 room1) (free robot3 rgripper3)
   added: (carry robot3 ball17 rgripper3)
   goals met: 0 of 22
3. (pick robot1 ball6 room5 lgripper1)
   deleted: (at ball6 room5) (free robot1 lgripper1)
   added: (carry robot1 ball6 lgripper1)
   goals met: 0 of 22
4. (move robot2 room14 room9)
   deleted: (at-robby robot2 room14)
   added: (at-robby robot2 room9)
   goals met: 0 of 22
5. (move robot3 room1 room6)
   deleted: (at-robby robot3 room1)
   added: (at-robby robot3 room6)
   goals met: 0 of 22
6. (move robot1 room5 room9)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room9)
   goals met: 0 of 22
7. (pick robot2 ball3 room9 lgripper2)
   deleted: (at ball3 room9) (free robot2 lgripper2)
   added: (carry robot2 ball3 lgripper2)
   goals met: 0 of 22
8. (drop robot3 ball20 room6 lgripper3)
   deleted: (carry robot3 ball20 lgripper3)
   added: (at ball20 room6) (free robot3 lgripper3)
   goals met: 1 of 22
9. (drop robot1 ball6 room9 lgripper1)
   deleted: (carry robot1 ball6 lgripper1)
   added: (at ball6 room9) (free robot1 lgripper1)
   goals met: 2 of 22
10. (move robot2 room9 room8)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room8)
   goals met: 2 of 22
11. (move robot3 room6 room13)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room13)
   goals met: 2 of 22
12. (move robot1 room9 room2)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room2)
   goals met: 2 of 22
13. (drop robot2 ball3 room8 lgripper2)
   deleted: (carry robot2 ball3 lgripper2)
   added: (at ball3 room8) (free robot2 lgripper2)
   goals met: 3 of 22
14. (pick robot2 ball5 room8 rgripper2)
   deleted: (at ball5 room8) (free robot2 rgripper2)
   added: (carry robot2 ball5 rgripper2)
   goals met: 3 of 22
15. (drop robot3 ball17 room13 rgripper3)
   deleted: (carry robot3 ball17 rgripper3)
   added: (at ball17 room13) (free robot3 rgripper3)
   goals met: 4 of 22
16. (pick robot1 ball2 room2 lgripper1)
   deleted: (at ball2 room2) (free robot1 lgripper1)
   added: (carry robot1 ball2 lgripper1)
   goals met: 4 of 22
17. (move robot2 room8 room9)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room9)
   goals met: 4 of 22
18. (move robot1 room2 room1)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room1)
   goals met: 4 of 22
19. (move robot3 room13 room7)
   deleted: (at-robby robot3 room13)
   added: (at-robby robot3 room7)
   goals met: 4 of 22
20. (move robot2 room9 room20)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room20)
   goals met: 4 of 22
21. (drop robot1 ball2 room1 lgripper1)
   deleted: (carry robot1 ball2 lgripper1)
   added: (at ball2 room1) (free robot1 lgripper1)
   goals met: 5 of 22
22. (pick robot3 ball19 room7 lgripper3)
   deleted: (at ball19 room7) (free robot3 lgripper3)
   added: (carry robot3 ball19 lgripper3)
   goals met: 5 of 22
23. (drop robot2 ball5 room20 rgripper2)
   deleted: (carry robot2 ball5 rgripper2)
   added: (at ball5 room20) (free robot2 rgripper2)
   goals met: 6 of 22
24. (pick robot2 ball8 room20 lgripper2)
   deleted: (at ball8 room20) (free robot2 lgripper2)
   added: (carry robot2 ball8 lgripper2)
   goals met: 6 of 22
25. (move robot3 room7 room4)
   deleted: (at-robby robot3 room7)
   added: (at-robby robot3 room4)
   goals met: 6 of 22
26. (move robot2 room20 room9)
   deleted: (at-robby robot2 room20)
   added: (at-robby robot2 room9)
   goals met: 6 of 22
27. (move robot1 room1 room9)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room9)
   goals met: 6 of 22
28. (drop robot3 ball19 room4 lgripper3)
   deleted: (carry robot3 ball19 lgripper3)
   added: (at ball19 room4) (free robot3 lgripper3)
   goals met: 7 of 22
29. (drop robot2 ball8 room9 lgripper2)
   deleted: (carry robot2 ball8 lgripper2)
   added: (at ball8 room9) (free robot2 lgripper2)
   goals met: 8 of 22
30. (pick robot3 ball22 room4 rgripper3)
   deleted: (at ball22 room4) (free robot3 rgripper3)
   added: (carry robot3 ball22 rgripper3)
   goals met: 8 of 22
31. (pick robot1 ball21 room9 lgripper1)
   deleted: (at ball21 room9) (free robot1 lgripper1)
   added: (carry robot1 ball21 lgripper1)
   goals met: 8 of 22
32. (move robot1 room9 room5)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room5)
   goals met: 8 of 22
33. (move robot3 room4 room17)
   deleted: (at-robby robot3 room4)
   added: (at-robby robot3 room17)
   goals met: 8 of 22
34. (move robot2 room9 room5)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room5)
   goals met: 8 of 22
35. (move robot2 room5 room8)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room8)
   goals met: 8 of 22
36. (drop robot1 ball21 room5 lgripper1)
   deleted: (carry robot1 ball21 lgripper1)
   added: (at ball21 room5) (free robot1 lgripper1)
   goals met: 9 of 22
37. (pick robot1 ball1 room5 rgripper1)
   deleted: (at ball1 room5) (free robot1 rgripper1)
   added: (carry robot1 ball1 rgripper1)
   goals met: 9 of 22
38. (pick robot3 ball18 room17 lgripper3)
   deleted: (at ball18 room17) (free robot3 lgripper3)
   added: (carry robot3 ball18 lgripper3)
   goals met: 9 of 22
39. (move robot1 room5 room18)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room18)
   goals met: 9 of 22
40. (move robot3 room17 room14)
   deleted: (at-robby robot3 room17)
   added: (at-robby robot3 room14)
   goals met: 9 of 22
41. (pick robot2 ball4 room8 lgripper2)
   deleted: (at ball4 room8) (free robot2 lgripper2)
   added: (carry robot2 ball4 lgripper2)
   goals met: 9 of 22
42. (drop robot1 ball1 room18 rgripper1)
   deleted: (carry robot1 ball1 rgripper1)
   added: (at ball1 room18) (free robot1 rgripper1)
   goals met: 10 of 22
43. (drop robot3 ball18 room14 lgripper3)
   deleted: (carry robot3 ball18 lgripper3)
   added: (at ball18 room14) (free robot3 lgripper3)
   goals met: 11 of 22
44. (move robot2 room8 room6)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room6)
   goals met: 11 of 22
45. (move robot3 room14 room10)
   deleted: (at-robby robot3 room14)
   added: (at-robby robot3 room10)
   goals met: 11 of 22
46. (drop robot2 ball4 room6 lgripper2)
   deleted: (carry robot2 ball4 lgripper2)
   added: (at ball4 room6) (free robot2 lgripper2)
   goals met: 12 of 22
47. (pick robot2 ball13 room6 rgripper2)
   deleted: (at ball13 room6) (free robot2 rgripper2)
   added: (carry robot2 ball13 rgripper2)
   goals met: 12 of 22
48. (move robot1 room18 room8)
   deleted: (at-robby robot1 room18)
   added: (at-robby robot1 room8)
   goals met: 12 of 22
49. (drop robot3 ball22 room10 rgripper3)
   deleted: (carry robot3 ball22 rgripper3)
   added: (at ball22 room10) (free robot3 rgripper3)
   goals met: 13 of 22
50. (move robot2 room6 room22)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room22)
   goals met: 13 of 22
51. (pick robot3 ball7 room10 lgripper3)
   deleted: (at ball7 room10) (free robot3 lgripper3)
   added: (carry robot3 ball7 lgripper3)
   goals met: 13 of 22
52. (move robot1 room8 room4)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room4)
   goals met: 13 of 22
53. (drop robot2 ball13 room22 rgripper2)
   deleted: (carry robot2 ball13 rgripper2)
   added: (at ball13 room22) (free robot2 rgripper2)
   goals met: 14 of 22
54. (pick robot2 ball16 room22 lgripper2)
   deleted: (at ball16 room22) (free robot2 lgripper2)
   added: (carry robot2 ball16 lgripper2)
   goals met: 14 of 22
55. (move robot3 room10 room11)
   deleted: (at-robby robot3 room10)
   added: (at-robby robot3 room11)
   goals met: 14 of 22
56. (pick robot1 ball15 room4 lgripper1)
   deleted: (at ball15 room4) (free robot1 lgripper1)
   added: (carry robot1 ball15 lgripper1)
   goals met: 14 of 22
57. (move robot2 room22 room8)
   deleted: (at-robby robot2 room22)
   added: (at-robby robot2 room8)
   goals met: 14 of 22
58. (drop robot3 ball7 room11 lgripper3)
   deleted: (carry robot3 ball7 lgripper3)
   added: (at ball7 room11) (free robot3 lgripper3)
   goals met: 15 of 22
59. (move robot1 room4 room23)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room23)
   goals met: 15 of 22
60. (drop robot2 ball16 room8 lgripper2)
   deleted: (carry robot2 ball16 lgripper2)
   added: (at ball16 room8) (free robot2 lgripper2)
   goals met: 16 of 22
61. (move robot3 room11 room21)
   deleted: (at-robby robot3 room11)
   added: (at-robby robot3 room21)
   goals met: 16 of 22
62. (drop robot1 ball15 room23 lgripper1)
   deleted: (carry robot1 ball15 lgripper1)
   added: (at ball15 room23) (free robot1 lgripper1)
   goals met: 17 of 22
63. (pick robot1 ball14 room23 rgripper1)
   deleted: (at ball14 room23) (free robot1 rgripper1)
   added: (carry robot1 ball14 rgripper1)
   goals met: 17 of 22
64. (pick robot3 ball10 room21 lgripper3)
   deleted: (at ball10 room21) (free robot3 lgripper3)
   added: (carry robot3 ball10 lgripper3)
   goals met: 17 of 22
65. (move robot1 room23 room18)
   deleted: (at-robby robot1 room23)
   added: (at-robby robot1 room18)
   goals met: 17 of 22
66. (move robot2 room8 room18)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room18)
   goals met: 17 of 22
67. (move robot3 room21 room15)
   deleted: (at-robby robot3 room21)
   added: (at-robby robot3 room15)
   goals met: 17 of 22
68. (drop robot1 ball14 room18 rgripper1)
   deleted: (carry robot1 ball14 rgripper1)
   added: (at ball14 room18) (free robot1 rgripper1)
   goals met: 18 of 22
69. (move robot2 room18 room16)
   deleted: (at-robby robot2 room18)
   added: (at-robby robot2 room16)
   goals met: 18 of 22
70. (drop robot3 ball10 room15 lgripper3)
   deleted: (carry robot3 ball10 lgripper3)
   added: (at ball10 room15) (free robot3 lgripper3)
   goals met: 19 of 22
71. (pick robot3 ball9 room15 rgripper3)
   deleted: (at ball9 room15) (free robot3 rgripper3)
   added: (carry robot3 ball9 rgripper3)
   goals met: 19 of 22
72. (move robot1 room18 room17)
   deleted: (at-robby robot1 room18)
   added: (at-robby robot1 room17)
   goals met: 19 of 22
73. (pick robot2 ball12 room16 lgripper2)
   deleted: (at ball12 room16) (free robot2 lgripper2)
   added: (carry robot2 ball12 lgripper2)
   goals met: 19 of 22
74. (move robot3 room15 room10)
   deleted: (at-robby robot3 room15)
   added: (at-robby robot3 room10)
   goals met: 19 of 22
75. (move robot2 room16 room18)
   deleted: (at-robby robot2 room16)
   added: (at-robby robot2 room18)
   goals met: 19 of 22
76. (pick robot1 ball11 room17 lgripper1)
   deleted: (at ball11 room17) (free robot1 lgripper1)
   added: (carry robot1 ball11 lgripper1)
   goals met: 19 of 22
77. (drop robot3 ball9 room10 rgripper3)
   deleted: (carry robot3 ball9 rgripper3)
   added: (at ball9 room10) (free robot3 rgripper3)
   goals met: 20 of 22
78. (move robot1 room17 room10)
   deleted: (at-robby robot1 room17)
   added: (at-robby robot1 room10)
   goals met: 20 of 22
79. (drop robot2 ball12 room18 lgripper2)
   deleted: (carry robot2 ball12 lgripper2)
   added: (at ball12 room18) (free robot2 lgripper2)
   goals met: 21 of 22
80. (drop robot1 ball11 room10 lgripper1)
   deleted: (carry robot1 ball11 lgripper1)
   added: (at ball11 room10) (free robot1 lgripper1)
   goals met: 22 of 22
